//==================Task-1=================================?
// Виконай рефакторинг методів об'єкта pizzaPalace, розставивши відсутні this в місцях звернення до властивостей і методів об'єкта.

// Вирішення:


//============================================================

//==================Task-2=================================
// Зміни код таким чином, щоб об'єкт parent став прототипом для об'єкта у змінній сhild.


// Вирішення:

// const parent = {
//     name: "Stacey",
//     surname: "Moore",
//     age: 54,
//     heritage: "Irish",
//   };
  
//   const child = Object.create(parent);
//   child.name = "Jason";
//   child.age = 27;
  
//============================================================

//==================Task-4=================================

// Зміни код, побудувавши ланцюжок прототипів таким чином, щоб об'єкт ancestor був прототипом для parent, а той, своєю чергою, був прототипом для child.

// Вирішення:

// const ancestor = {
//     name: "Paul",
//     age: 83,
//     surname: "Dawson",
//     heritage: "Irish",
//   };
  
//   const parent = Object.create(ancestor);
//   parent.name = "Stacey";
//   parent.surname = "Moore";
//   parent.age = 54;
  
//   const child = Object.create(parent);
//   child.name = "Jason";
//   child.age = 27;

//============================================================

//==================Task-5=================================

// Вирішення:

//============================================================

//==================Task-6=================================

// Вирішення:

//============================================================

//==================Task-7=================================

// Вирішення:

//============================================================

//==================Task-8=================================

// Вирішення:

//============================================================

//==================Task-9=================================

// Вирішення:

//============================================================

